In [2]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [1]:
#Q1. List any five functions of the pandas library with execution.

#Funtions 
# 1)describe():-Gives overview about the data
# 2)dtypes:-Give the total colums with there data types in series format
# 3)Categorical:-Gives the no. or the list of unique values in that column
# 4)max():-Return the max of the perticular column
# 5)columns:-gives the name of all columns

import pandas as pd

df=pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')

#describe()
print('DESCRIBE()')
df.describe()

DESCRIBE()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [25]:
print('dtypes')
df.dtypes

dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [26]:
print('Categorical')
pd.Categorical(df['Pclass'])

Categorical

[3, 1, 3, 1, 3, ..., 2, 1, 3, 1, 3]
Length: 891
Categories (3, int64): [1, 2, 3]

In [27]:
print('max')
max(df['Fare'])

max

512.3292

In [28]:
print('Columns')
df.columns

Columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [45]:
# Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function
# to re-index the DataFrame with a new index that starts from 1 and increments by 2 
# for each row.



data=[['A','B','C'],[1,2,3],[4,5,6],[7,8,9]]
df1=pd.DataFrame(data)
df1=df1.reset_index(drop=True)
newindex=range(1, 2 * len(df1) + 1, 2)
df1.index=newindex
df1

   0  1  2
1  A  B  C
3  1  2  3
5  4  5  6
7  7  8  9

In [60]:
# Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function
# that iterates over the DataFrame and calculates the sum of the first three values in the
# 'Values' column. The function should print the sum to the console.
 
data=['Values',1,2,3,4,5,6]
df2 = pd.DataFrame({data[0]:data[1:]})
df2[df2.index < 3]['Values'].sum()

6

In [9]:
# Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
# 'Word_Count' that contains the number of words in each row of the 'Text' column.


df3=pd.DataFrame({'Text':['Vaibhav','deep','Ronak','Bhavesh','rohit']})
def fun(df):
    df['word_count']=df['Text'].str.count(' ')+1
    return df
df3=fun(df3)
df3

      Text  word_count
0  Vaibhav           1
1     deep           1
2    Ronak           1
3  Bhavesh           1
4    rohit           1

In [14]:
# How are DataFrame.size() and DataFrame.shape() different?

# DataFrame.size returns the total number of elements in the DataFrame, which is 
# calculated by multiplying the number of rows by the number of columns.

# DataFrame.shape returns a tuple representing the dimensions of the DataFrame, where the 
# first element is the number of rows and the second element is the number of columns.

df3=pd.DataFrame({'Text':['Vaibhav','deep','Ronak','Bhavesh','rohit']})
df3.shape
df3.size

5

In [ ]:
# Q6. Which function of pandas do we use to read an excel file?

pd.read_excel() is used

In [16]:
# Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
# addresses in the format 'username@domain.com'. Write a Python function that creates a new column
# 'Username' in df that contains only the username part of each email address.

data={'email':['vaibhav@gmail.com','deep@gmail.com','ronak@gmail.com']}
df4=pd.DataFrame(data)

def extract_username(email):
    return email.split('@')[0]
df4['Username']=df4['email'].apply(extract_username)
df4

               email Username
0  vaibhav@gmail.com  vaibhav
1     deep@gmail.com     deep
2    ronak@gmail.com    ronak

In [25]:
# Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python 
# function that selects all rows where the value in column 'A' is greater than 5 and the
# value in column 'B' is less than 10. The function should return a new DataFrame that 
# contains only the selected rows.

data={'A':[3,8,6,2,9],'B':[5,2,9,3,1],'C':[1,7,4,5,2]}
df5=pd.DataFrame(data)
df5[(df5['A']>5) &(df5['B']<10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [29]:
# Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to 
# calculate the mean, median, and standard deviation of the values in the 'Values' column.

data={'Values':[3,4,5,6,7,8,2,3,6]}
df6=pd.DataFrame(data)

def fun(df):
    return df['Values'].mean(),df['Values'].median(),df['Values'].std()
fun(df6)

(4.888888888888889, 5.0, 2.0275875100994063)

In [3]:
# Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a
# Python function to create a new column 'MovingAverage' that contains the moving average 
# of the sales for the past 7 days for each row in the DataFrame. The moving average should
# be calculated using a window of size 7 and should include the current day.



def moving_average(df):
 

  # Calculate the moving average using a window of size 7.
  moving_average = df['Sales'].rolling(window=7).mean()

  # Add the moving average column to the DataFrame.
  df['MovingAverage'] = moving_average

  return df

df = pd.DataFrame({'Date': ['2023-08-20', '2023-08-21', '2023-08-22', '2023-08-23', '2023-08-24', '2023-08-25', '2023-08-26', '2023-08-27'],
                   'Sales': [100, 120, 130, 150, 160, 140, 180, 200]})

moving_average(df)

         Date  Sales  MovingAverage
0  2023-08-20    100            NaN
1  2023-08-21    120            NaN
2  2023-08-22    130            NaN
3  2023-08-23    150            NaN
4  2023-08-24    160            NaN
5  2023-08-25    140            NaN
6  2023-08-26    180     140.000000
7  2023-08-27    200     154.285714

In [6]:
#Q10

df = pd.DataFrame({'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05']})
df['Date'] = pd.to_datetime(df['Date'])
import datetime

def fun(df):
    weekday=df['Date'].dt.day_name()
    df['Weekday'] = weekday
    return df

fun(df)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

In [ ]:
# Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
# function to select all rows where the date is between '2023-01-01' and '2023-01-31'.




df = pd.DataFrame({'Date': ['2023-01-01', '2023-02-01', '2023-03-01', '2023-04-01']})
def filter_by_date(df):
  

  # Convert the Date column to a datetimelike dtype.
  df['Date'] = pd.to_datetime(df['Date'])

  # Select the rows where the date is between '2023-01-01' and '2023-01-31'.
  filtered_df = df[df['Date'].between('2023-01-01', '2023-01-31')]

  return filtered_df

filtered_df = filter_by_date(df.copy())

print(filtered_df)